<?php

use yii\helpers\Html;

$this->title = 'Dashboard';
?>
<div class="row">
    <div class="page-header"><?= Html::encode($this->title) ?></div>
</div>
<br/>
<div class="admin-default-index">        
    <p>
        การบริการจัดการเว็บไซต์วิทยาเขตหนองคาย
    <ul>
        <li>หน่วยงานสามารถส่งข่าวประชาสัมพันธ์ผ่านเว็บไซต์ได</li>
        <li>หน่วยงานสามารถสร้างเนื้อหาของหน่วยงานบนเว็บไซต์วิทยาเขตได้</li>
        <li>หน่วยงานสามารถสร้างเมนูของหน่วยงานเองได้</li>
        <li>หน่วยงานสามารถแนบรูปภาพหรือไฟล์เอกสารได้ง่าย</li>
    </ul>
</p>
<p>
    ออกแบบและพัฒนาโดย: นายจตุพล โพธิ์คำพก 
</p>
</div>

