models/Menus.php

    public function listCategorySub($parent, $space = '|---') {
        global $arr;

        $children = Menus::find()
                ->where(['parent_id' => $parent])
                ->orderBy('ordering')
                ->all();
        foreach ($children as $child) {
            $data = array();
            $data['id'] = $child->id;
            $data['names'] = $space . ' ' . $child->names;
            $data['published'] = $child->published;
            $data['ordering'] = $child->ordering;
            $data['min'] = $this->orderMin($child->langs, $child->type, $child->parent_id);
            $data['max'] = $this->orderMax($child->langs, $child->type, $child->parent_id);
---
SELECT a.id, a.names, a.icons, a.urls, a.type, a.target, Deriv1.Count FROM `tbl_menus` a  LEFT OUTER JOIN (SELECT parent_id, COUNT(*) AS Count FROM `tbl_menus` GROUP BY parent_id) Deriv1 ON a.id = Deriv1.parent_id WHERE a.parent_id=0 AND a.published=1 AND a.type=7 ORDER BY a.ordering